#### Data wrangling using Pandas

##### data cleaning, data remediation, or data munging

In [1]:
data = {"name":["A","B","C","D","E"], 
       "gender":["F","M","F","M","M"],
       "country":["Bulgeria","USA","USA","UK","Netherlands"],
       "age":[23,24,46,19,72]}

In [2]:
data

{'name': ['A', 'B', 'C', 'D', 'E'],
 'gender': ['F', 'M', 'F', 'M', 'M'],
 'country': ['Bulgeria', 'USA', 'USA', 'UK', 'Netherlands'],
 'age': [23, 24, 46, 19, 72]}

In [3]:
import pandas as pd

In [6]:
df = pd.DataFrame(data)
df

  name gender      country  age
0    A      F     Bulgeria   23
1    B      M          USA   24
2    C      F          USA   46
3    D      M           UK   19
4    E      M  Netherlands   72

In [7]:
df.columns

Index(['name', 'gender', 'country', 'age'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
# change or set index

# drop = True will remove 'name' from dataframe

# inplace = True will add it automatically, no need to explicitely tell to add index

df.set_index('name', drop=True,inplace=True)

In [13]:
df

     gender      country  age
name
A         F     Bulgeria   23
B         M          USA   24
C         F          USA   46
D         M           UK   19
E         M  Netherlands   72

In [23]:
# .reset takes it back to original place

df.reset_index(inplace=False, drop=True)

  gender      country  age
0      F     Bulgeria   23
1      M          USA   24
2      F          USA   46
3      M           UK   19
4      M  Netherlands   72

In [33]:
# checked something, inplace = True, drop=False
# this setting added level_0 column, still confused about it

df

   level_0  index gender      country  age
0        0      0      F     Bulgeria   23
1        1      1      M          USA   24
2        2      2      F          USA   46
3        3      3      M           UK   19
4        4      4      M  Netherlands   72

In [35]:
# setting inplace=False, drop=Flase 
# should revert it back to original data frame